{
  "1508.04850v1": {
    "title": "Executable Behaviour and the π-Calculus (extended abstract)",
    "authors": [
      "Bas Luttik",
      "Fei Yang"
    ],
    "summary": "Reactive Turing machines extend classical Turing machines with a facility to\nmodel observable interactive behaviour. We call a behaviour executable if, and\nonly if, it is behaviourally equivalent to the behaviour of a reactive Turing\nmachine. In this paper, we study the relationship between executable behaviour\nand behaviour that can be specified in the pi-calculus. We establish that all\nexecutable behaviour can be specified in the pi-calculus up to\ndivergence-preserving branching bisimilarity. The converse, however, is not\ntrue due to (intended) limitations of the model of reactive Turing machines.\nThat is, the pi-calculus allows the specification of behaviour that is not\nexecutable up to divergence-preserving branching bisimilarity. Motivated by an\nintuitive understanding of executability, we then consider a restriction on the\noperational semantics of the pi-calculus that does associate with every pi-term\nexecutable behaviour, at least up to the version of branching bisimilarity that\ndoes not require the preservation of divergence.",
    "pdf_url": "http://arxiv.org/pdf/1508.04850v1",
    "published": "2015-08-20"
  },
  "cond-mat/0001141v1": {
    "title": "The temperature dependent behaviour of surface states in ferromagnetic semiconductors",
    "authors": [
      "R. Schiller",
      "W. Mueller",
      "W. Nolting"
    ],
    "summary": "We present a model calculation for the temperature dependent behaviour of\nsurface states on a ferromagnetic local-moment film. The film is described\nwithin the s-f model featuring local magnetic moments being exchange coupled to\nthe itinerant conduction electrons. The surface states are generated by\nmodifying the hopping in the vicinity of the surface of the film. In the\ncalculation for the temperature dependent behaviour of the surface states we\nare able to reproduce both Stoner-like and spin-mixing behaviour in agreement\nwith recent (inverse) photoemission data on the temperature dependent behaviour\nof a Gd(0001) surface state.",
    "pdf_url": "http://arxiv.org/pdf/cond-mat/0001141v1",
    "published": "2000-01-11"
  }
}